code/openfoam/etc/templates/closedVolume/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInitial        0.005;

dimensions      [turbulentKineticEnergy];

internalField   uniform $kInitial;

boundaryField
{
    wall
    {
        type            kqRWallFunction;
        value           uniform $kInitial;
    }
}

// ************************************************************************* //
